Revit 2027 API
FamilyUtils Class
 Contains utilities related to family operations.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FamilyUtils
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class FamilyUtils
Public NotInheritable Class FamilyUtils
public ref class FamilyUtils abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type FamilyUtils = class end
The FamilyUtils type exposes the following members.
Methods
Name | Description
ConvertFamilyToFaceHostBased |  Converts a family to be face host based.
FamilyCanConvertToFaceHostBased |  Indicates whether the family can be converted to face host based.
GetProfileSymbols |  Gets the profile Family Symbols of the document.
Top
See Also
Reference
Autodesk.Revit.DB Namespace